
## Plan Result (list-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/8029)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 0 to change, 2 to destroy.</code></pre>

* Create
  * local_file.application_ecs_service_appspec_94386B9C
* Replace
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4
  * null_resource.application_ecs_service_create-task-definition-file_6BADBAF7


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/ListAPI-Prod:916" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/ListAPI-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment            = [
                        # (6 unchanged elements hidden)
                        {
                            name  = "OTLP_COLLECTOR_HOST"
                            value = "localhost"
                        },
                      ~ {
                            name  = "RELEASE_SHA"
                          ~ value = "420f374f2925627230a32cff18b91690278907d8" -> "4b191d3d8b87574b7354ff0ff76d4cc8556d4fee"
                        },
                        {
                            name  = "SQS_BATCH_DELETE_QUEUE_URL"
                            value = "https://sqs.us-east-1.amazonaws.com/996905175585/ListAPI-Prod-Sqs-Batch-Delete-Consumer-Queue"
                        },
                        # (2 unchanged elements hidden)
                    ]
                    name                   = "app"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (9 unchanged attributes hidden)
                },
              ~ {
                    name                   = "aws-otel-collector"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (10 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "ListAPI-Prod" -> (known after apply)
      ~ revision                 = 916 -> (known after apply)
        tags                     = {
            "environment" = "Prod"
            "service"     = "ListAPI"
        }
        # (9 unchanged attributes hidden)
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

  # null_resource.application_ecs_service_create-task-definition-file_6BADBAF7 must be replaced
-/+ resource "null_resource" "application_ecs_service_create-task-definition-file_6BADBAF7" {
      ~ id       = "3788510607762494902" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "alwaysRun" = "2024-01-09T15:40:14Z" -> (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 2 to destroy.
╷
│ Warning: Deprecated attribute
│ 
│   on cdk.tf.json line 1971, in resource.aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84:
│ 1971:         "endpoint": "https://events.pagerduty.com/integration/${pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5.integration_key}/enqueue",
│ 
│ The attribute "integration_key" is deprecated. Refer to the provider
│ documentation for details.
│ 
│ (and 3 more similar warnings elsewhere)
╵
```

</details>



## :warning: Warnings

```hcl
Warning: Deprecated attribute
 
   on cdk.tf.json line 1971, in resource.aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84:
 1971:         "endpoint": "https://events.pagerduty.com/integration/${pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5.integration_key}/enqueue",
 
 The attribute "integration_key" is deprecated. Refer to the provider
 documentation for details.
 
 (and 3 more similar warnings elsewhere)
```



<!-- github-comment: {"Command":"plan","JobID":"195699ca-99e8-452c-98ce-7dbdb30f2051","JobName":"list-api_infrastructure_plan_prod","PRNumber":44,"Program":"tfcmt","SHA1":"4b191d3d8b87574b7354ff0ff76d4cc8556d4fee","Target":"list-api-cdk","Vars":{}} -->